Revit 2024 API
DocumentChangedEventArgs Class
 The event arguments used by the DocumentChanged event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class DocumentChangedEventArgs : RevitAPISingleEventArgs
Visual Basic
Public Class DocumentChangedEventArgs _
	Inherits RevitAPISingleEventArgs
Visual C++
public ref class DocumentChangedEventArgs : public RevitAPISingleEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.DocumentChangedEventArgs
See Also
DocumentChangedEventArgs Members
Autodesk.Revit.DB.Events Namespace